package com.vacuum.app.dostor.Dostor2012;

import android.content.Context;
import android.graphics.Typeface;
import android.os.Bundle;
import android.support.v4.app.Fragment;
import android.support.v7.widget.DefaultItemAnimator;
import android.support.v7.widget.LinearLayoutManager;
import android.support.v7.widget.RecyclerView;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.widget.TextView;
import android.widget.Toast;

import com.vacuum.app.dostor.Model.Item;
import com.vacuum.app.dostor.R;

import java.util.ArrayList;
import java.util.Arrays;
import java.util.HashSet;
import java.util.List;
import java.util.Scanner;
import java.util.Set;
import java.util.regex.Matcher;
import java.util.regex.Pattern;

/**
 * Created by Home on 2017-09-09.
 */

public class Fragment_2012 extends Fragment {

    RecyclerView recyclerView;
    int position;
    View view;
    Context mContext;
    Adapter2012 adapter2012;
    List<Item> items;
    @Override
    public View onCreateView(LayoutInflater inflater, ViewGroup container,
                             Bundle savedInstanceState) {


        /*if (isNetworkConnected()) {
            new MyTask(this.getContext(),recyclerView).execute();
        } else {
            Toast.makeText(this.getContext(), "error", Toast.LENGTH_SHORT).show();
        }*/
        position = getArguments().getInt("position");
        if(position == 0)
        {
            view = inflater.inflate(R.layout.intro_layout, container, false);
            Toast.makeText(view.getContext(), String.valueOf(position), Toast.LENGTH_SHORT).show();
            TextView intro_1 = view.findViewById(R.id.intro_1);
            TextView intro_2 = view.findViewById(R.id.intro_2);
            //===============================================================
            Typeface sky = Typeface.createFromAsset(view.getContext().getAssets(),
                    "fonts/sky.ttf");
            Typeface Gess_two = Typeface.createFromAsset(view.getContext().getAssets(),
                    "fonts/GE_SS_Two_Bold.otf");
            //==========================================================================
            intro_1.setTypeface(sky);
            intro_2.setTypeface(Gess_two);
            intro_2.setText(R.string.intro_2_2012);
        }else if (position == 1){
            view = inflater.inflate(R.layout.fragment_two, container, false);
            recyclerView =  view.findViewById(R.id.recycler_view_two);
            section_1();

        }else if (position == 2){
            view = inflater.inflate(R.layout.fragment_two, container, false);
            recyclerView =  view.findViewById(R.id.recycler_view_two);
            section_2();
        }else if (position == 3){
            view = inflater.inflate(R.layout.fragment_two, container, false);
            recyclerView =  view.findViewById(R.id.recycler_view_two);
            section_3();
        }else if (position == 4){
            view = inflater.inflate(R.layout.fragment_two, container, false);
            recyclerView =  view.findViewById(R.id.recycler_view_two);
            section_4();
        }else if (position == 5){
            view = inflater.inflate(R.layout.fragment_two, container, false);
            recyclerView =  view.findViewById(R.id.recycler_view_two);
            section_5();
        }
        return view;
    }


    private void section_1() {
        items = new ArrayList<>();

        items.add(new Item("مادة 1", "جمهورية مصر العربية دولة مستقلة ذات سيادة، موحدة لا تقبل التجزئة، ونظامها ديمقراطى." +
                "والشعب المصرى جزء من الأمتين العربية والإسلامية، ويعتز بانتمائه لحوض النيل والقارة الأفريقية وبامتداده الآسيوى، ويشارك بإيجابية فى الحضارة الإنسانية."));
        items.add(new Item("مادة 2", "الإسلام دين الدولة، واللغة العربية لغتها الرسمية، ومبادئ الشريعة الإسلامية المصدر الرئيسى للتشريع"));
        items.add(new Item("مادة 3","مبادئ شرائع المصريين من المسيحيين واليهود المصدر الرئيسى للتشريعات المنظِّمة لأحوالهم الشخصية، وشئونهم الدينية، واختيار قياداتهم الروحية."));
        items.add(new Item("مادة 4","الأزهر الشريف هيئة إسلامية مستقلة جامعة، يختص دون غيره بالقيام على كافة شئونه، ويتولى نشر الدعوة الإسلامية وعلوم الدين واللغة العربية فى مصر والعالم. ويؤخذ رأى هيئة كبار العلماء بالأزهر الشريف فى الشئون المتعلقة بالشريعة الإسلامية.\n" +
                "وتكفل الدولة الاعتمادات المالية الكافية لتحقيق أغراضه. وشيخ الأزهر مستقل غير قابل للعزل، يحدد القانون طريقة اختياره من بين أعضاء هيئة كبار العلماء. وكل ذلك على النحو الذى ينظمه القانون."));
        items.add(new Item("مادة 5", "السيادة للشعب يمارسها ويحميها، ويصون وحدته الوطنية، وهو مصدر السلطات؛ وذلك على النحو المبين فى الدستور.\n"));
        items.add(new Item("مادة 6", "يقوم النظام السياسى على مبادئ الديمقراطية والشورى، والمواطنة التى تسوى بين جميع المواطنين فى الحقوق والواجبات العامة، والتعددية السياسية والحزبية، والتداول السلمى للسلطة، والفصل بين السلطات والتوازن بينها، وسيادة القانون، واحترام حقوق الإنسان وحرياته؛ وذلك كله على النحو المبين فى الدستور.\n" +
                "ولا يجوز قيام حزب سياسى على أساس التفرقة بين المواطنين؛ بسبب الجنس أو الأصل أو الدين."));
        items.add(new Item("مادة 7", "الحفاظ على الأمن القومى، والدفاع عن الوطن وحماية أرضه، شرف وواجب مقدس. والتجنيد إجبارى؛ وفقا لما ينظمه القانون.\n"));
        items.add(new Item("مادة 8", "تكفل الدولة وسائل تحقيق العدل والمساواة والحرية، وتلتزم بتيسير سبل التراحم والتكافل الاجتماعى والتضامن بين أفراد المجتمع، وتضمن حماية الأنفس والأعراض والأموال، وتعمل على تحقيق حد الكفاية لجميع المواطنين؛ وذلك كله فى حدود القانون."));
        items.add(new Item("مادة 9", "تلتزم الدولة بتوفير الأمن والطمأنينة وتكافؤ الفرص لجميع المواطنين، دون تمييز."));
        items.add(new Item("مادة 10", "الأسرة أساس المجتمع، قوامها الدين والأخلاق والوطنية.\n" +
                "وتحرص الدولة والمجتمع على الالتزام بالطابع الأصيل للأسرة المصرية، وعلى تماسكها واستقرارها، وترسيخ قيمها الأخلاقية وحمايتها؛ وذلك على النحو الذى ينظمه القانون.\n" +
                "وتكفل الدولة خدمات الأمومة والطفولة بالمجان، والتوفيق بين واجبات المرأة نحو أسرتها وعملها العام.\n" +
                "وتولى الدولة عناية وحماية خاصة للمرأة المُعيلة والمطلقة والأرملة."));
        items.add(new Item("مادة 11", "ترعى الدولة الأخلاق والآداب والنظام العام، والمستوى الرفيع للتربية والقيم الدينية والوطنية، والحقائق العلمية، والثقافة العربية، والتراث التاريخى والحضارى للشعب؛ وذلك وفقا لما ينظمه القانون."));
        items.add(new Item("مادة 12", "تحمى الدولة المقومات الثقافية والحضارية واللغوية للمجتمع، وتعمل على تعريب التعليم والعلوم والمعارف."));
        items.add(new Item("مادة 13", "إنشاء الرتب المدنية محظور."));
        items.add(new Item("مادة 14", "يهدف الاقتصاد الوطنى إلى تحقيق التنمية المطردة الشاملة، ورفع مستوى المعيشة وتحقيق الرفاه، والقضاء على الفقر والبطالة، وزيادة فرص العمل والإنتاج والدخل القومى.\n" +
                "وتعمل خطة التنمية على إقامة العدالة الاجتماعية والتكافل، وضمان عدالة التوزيع، وحماية حقوق المستهلك، والمحافظة على حقوق العاملين، والمشاركة بين رأس المال والعمل فى تحمل تكاليف التنمية، والاقتسام العادل لعوائدها.\n" +
                "ويجب ربط الأجر بالإنتاج، وتقريب الفوارق بين الدخول، وضمان حد أدنى للأجور والمعاشات يكفل حياة كريمة لكل مواطن، وحد أقصى فى أجهزة الدولة لا يستثنى منه إلا بناء على قانون."));
        items.add(new Item("مادة 15", "الزراعة مقوم أساسى للاقتصاد الوطنى، وتلتزم الدولة بحماية الرقعة الزراعية وزيادتها، وتعمل على تنمية المحاصيل والأصناف النباتية والسلالات الحيوانية والثروة السمكية وحمايتها، وتحقيق الأمن الغذائى، وتوفير متطلبات الإنتاج الزراعى وحسن إدارته وتسويقه، ودعم الصناعات الزراعية.\n" +
                "وينظم القانون استخدام أراضى الدولة؛ بما يحقق العدالة الاجتماعية، ويحمى الفلاح والعامل الزراعى من الاستغلال."));
        items.add(new Item("مادة 16", "تلتزم الدولة بتنمية الريف والبادية، وتعمل على رفع مستوى معيشة الفلاحين وأهل البادية."));
        items.add(new Item("مادة 17", "الصناعة مقوم أساسى للاقتصاد الوطني، وتحمى الدولة الصناعات الاستراتيجية، وتَدْعُم التطور الصناعي، وتضمن توطين التقنيات الحديثة وتطبيقاتها.\n" +
                "وترعى الدولة الصناعات الحرفية والصغيرة."));
        items.add(new Item("مادة 18", "الثروات الطبيعية للدولة ملك الشعب، وعوائدها حق له، تلتزم الدولة بالحفاظ عليها، وحسن استغلالها، ومراعاة حقوق الأجيال فيها.\n" +
                "ولا يجوز التصرف فى أملاك الدولة، أو منح امتياز باستغلالها، أو التزام مرفق عام، إلا بناء على قانون.\n" +
                "وكل مال لا مالك له فهو ملك الدولة."));

        items.add(new Item("مادة 19", "نهر النيل وموارد المياه ثروة وطنية، تلتزم الدولة بالحفاظ عليها وتنميتها، ومنع الاعتداء عليها. وينظم القانون وسائل الانتفاع بها." ));
        items.add(new Item("مادة 20", "تلتزم الدولة بحماية شواطئها وبحارها وممراتها المائية وبحيراتها، وصيانة الآثار والمحميات الطبيعية، وإزالة ما يقع عليها من تعديات."));
        items.add(new Item("مادة 21", "تكفل الدولة الملكية المشروعة بأنواعها العامة والتعاونية والخاصة والوقف، وتحميها؛ وفقا لما ينظمه القانون."));
        items.add(new Item("مادة 22", "للأموال العامة حرمة، وحمايتها واجب وطنى على الدولة والمجتمع."));
        items.add(new Item("مادة 23", "ترعى الدولة التعاونيات بكل صورها، وتدعمها، وتكفل استقلالها."));
        items.add(new Item("مادة 24", "الملكية الخاصة مصونة، تؤدى وظيفتها الاجتماعية فى خدمة الاقتصاد الوطنى دون انحراف أو احتكار، وحق الإرث فيها مكفول. ولا يجوز فرض الحراسة عليها إلا فى الأحوال المبينة فى القانون، وبحكم قضائى؛ ولا تنزع إلا للمنفعة العامة، ومقابل تعويض عادل يُدفع مقدما.\n" +
                "وذلك كله وفقا لما ينظمه القانون."));
        items.add(new Item("مادة 25", "تلتزم الدولة بإحياء نظام الوقف الخيرى وتشجيعه.\n" +
                "وينظم القانون الوقف، ويحدد طريقة إنشائه وإدارة أمواله، واستثمارها، وتوزيع عوائده على مستحقيها؛ وفقا لشروط الواقف."));
        items.add(new Item("مادة 26", "العدالة الاجتماعية أساس الضرائب وغيرها من التكاليف المالية العامة.\n" +
                "ولا يكون إنشاء الضرائب العامة ولا تعديلها ولا إلغاؤها إلا بقانون، ولا يُعفى أحد من أدائها فى غير الأحوال المبينة فى القانون. ولا يجوز تكليف أحد بأداء غير ذلك من الضرائب والرسوم إلا فى حدود القانون."));
        items.add(new Item("مادة 27", "للعاملين نصيب فى إدارة المشروعات وفى أرباحها، ويلتزمون بتنمية الإنتاج والمحافظة على أدواته وتنفيذ خطته فى وحداتهم الإنتاجية، وفقا للقانون.\n" +
                "ويكون تمثيل العمال فى مجالس إدارة وحدات القطاع العام فى حدود خمسين بالمائة من عدد الأعضاء المنتخبين فى هذه المجالس. ويكفل القانون تمثيل صغار الفلاحين وصغار الحرفيين بنسبة لا تقل عن ثمانين بالمائة فى عضوية مجالس إدارة الجمعيات التعاونية الزراعية والصناعية."));
        items.add(new Item("مادة 28", "تشجع الدولة الادخار، وتحمى المدخرات وأموال التأمينات والمعاشات.\n" +
                "وينظم القانون ذلك."));
        items.add(new Item("مادة 29", "لا يجوز التأميم إلا لاعتبارات الصالح العام، وبقانون، ومقابل تعويض عادل."));
        items.add(new Item("مادة 30", "المصادرة العامة للأموال محظورة.\n" +
                "ولا تجوز المصادرة الخاصة إلا بحكم قضائى."));
        make_adapter();
    }

    private void  section_2() {
        items = new ArrayList<>();
        items.add(new Item("مادة 31", "الكرامة حق لكل إنسان، يكفل المجتمع والدولة احترامها وحمايتها.\n" +
                "ولا يجوز بحال إهانة أى إنسان أو ازدراؤه."));
        items.add(new Item("مادة 32", "الجنسية المصرية حق، وينظمه القانون."));
        items.add(new Item("مادة 33", "المواطنون لدى القانون سواء؛ وهم متساوون فى الحقوق والواجبات العامة، لا تمييز بينهم فى ذلك.\n"));
        items.add(new Item("مادة 34", "الحرية الشخصية حق طبيعى؛ وهى مصونة لا تمس.\n"));
        items.add(new Item("مادة 35", "فيما عدا حالة التلبس، لا يجوز القبض على أحد ولا تفتيشه ولا حبسه ولا منعه من التنقل ولا تقييد حريته بأى قيد إلا بأمر قضائى مسبب يستلزمه التحقيق.\n" +
                "ويجب أن يبلغ كل من تقيد حريته بأسباب ذلك كتابة خلال اثنتى عشرة ساعة، وأن يقدم إلى سلطة التحقيق خلال أربع وعشرين ساعة من وقت تقييد حريته؛ ولا يجرى التحقيق معه إلا فى حضور محاميه؛ فإن لم يكن ندب له محام.\n" +
                "ولكل من تقيد حريته، ولغيره، حق التظلم أمام القضاء من ذلك الإجراء والفصل فيه خلال أسبوع، وإلا وجب الإفراج حتما.\n" +
                "وينظم القانون أحكام الحبس الاحتياطى ومدته وأسبابه، وحالات استحقاقالتعويض وأدائه عن الحبس الاحتياطى، أو عن تنفيذ عقوبة صدر حكم بات بإلغاء الحكم المنفذة بموجبه."));
        items.add(new Item("مادة 36", "كل من يقبض عليه، أو يحبس، أو تقيد حريته بأى قيد، تجب معاملته بما يحفظ كرامته. ولا يجوز تعذيبه، ولا ترهيبه، ولا إكراهه، ولا إيذاؤه بدنيا أو معنويا.\n" +
                "ولا يكون حجزه ولا حبسه إلا فى أماكن لائقة إنسانيا وصحيا، وخاضعة للإشراف القضائى.\n" +
                "ومخالفة شىء من ذلك جريمة يُعاقب مرتكبها، وفقا للقانون.\n" +
                "وكل قول صدر تحت وطأة أى مما تقدم، أو التهديد بشىء منه، يهدر ولا يعول عليه."));
        items.add(new Item("مادة 37", "السجن دار تأديب وتهذيب وإصلاح؛ يخضع للإشراف القضائى، ويحظر فيه كل ما ينافى كرامة الإنسان، أو يعرض صحته للخطر.\n" +
                "وتُعنى الدولة بتأهيل المحكوم عليهم، وتيسر لهم سبل الحياة الكريمة بعد الإفراج عنهم."));
        items.add(new Item("مادة 38", "لحياة المواطنين الخاصة حرمة، وسريتها مكفولة. ولا يجوز مصادرة المراسلات البريدية والبرقية والإلكترونية والمحادثات الهاتفية وغيرها من وسائل الاتصال؛ ولا مراقبتها، ولا الاطلاع عليها إلا لمدة محددة، وفى الأحوال التى يبينها القانون، وبأمر قضائى مسبب."));
        items.add(new Item("مادة 39", "للمنازل حرمة. وفيما عدا حالات الخطر والاستغاثة، لا يجوز دخولها، ولا تفتيشها، ولا مراقبتها إلا فى الأحوال المبينة فى القانون، وبأمر قضائى مسبب يحدد المكان والتوقيت والغرض. ويجب تنبيه من فى المنازل قبل دخولها أو تفتيشها."));
        items.add(new Item("مادة 40", "الحياة الآمنة حق تكفله الدولة لكل مقيم على أراضيها، ويحمى القانون الإنسان مما يهدده من ظواهر إجرامية."));
        items.add(new Item("مادة 41", "لجسد الإنسان حرمة، ويحظر الاتجار بأعضائه. ولا يجوز أن تجرى عليه التجارب الطبية أو العلمية بغير رضاه الحر الموثق، ووفقا للأسس المستقرة فى العلوم الطبية، وعلى النحو الذى ينظمه القانون."));
        items.add(new Item("مادة 42", "حرية التنقل والإقامة والهجرة مكفولة. ولا يجوز بحال إبعاد أى مواطن عن إقليم الدولة، ولا منعه من العودة إليه. ولا يكون منعه من مغادرة الدولة، ولا فرض الإقامة الجبرية عليه إلا بأمر قضائى مسبب، ولمدة محددة."));
        items.add(new Item("مادة 43", "حرية الاعتقاد مصونة. وتكفل الدولة حرية ممارسة الشعائر الدينية وإقامة دور العبادة للأديان السماوية؛ وذلك على النحو الذى ينظمه القانون."));
        items.add(new Item("مادة 44", "تُحظر الإساءة أو التعريض بالرسل والأنبياء كافة."));
        items.add(new Item("مادة 45", "حرية الفكر والرأى مكفولة. ولكل إنسان حق التعبير عن رأيه بالقول أو الكتابة أو التصوير أو غير ذلك من وسائل النشر والتعبير."));
        items.add(new Item("مادة 46", "حرية الإبداع بأشكاله المختلفة حق لكل مواطن. وتنهض الدولة بالعلوم والفنون والآداب، وترعى المبدعين والمخترعين، وتحمى إبداعاتهم وابتكاراتهم، وتعمل على تطبيقها لمصلحة المجتمع. وتتخذ الدولة التدابير اللازمة للحفاظ على التراث الثقافى الوطنى، وتعمل على نشر الخدمات الثقافية."));
        items.add(new Item("مادة 47", "الحصول على المعلومات والبيانات والإحصاءات والوثائق، والإفصاح عنها، وتداولها، حق تكفله الدولة لكل مواطن؛ بما لا يمس حرمة الحياة الخاصة، وحقوق الآخرين، ولا يتعارض مع الأمن القومى. وينظم القانون قواعد إيداع الوثائق العامة وحفظها، وطريقة الحصول على المعلومات، والتظلم من رفض إعطائها، وما قد يترتب على هذا الرفض من مساءلة."));
        items.add(new Item("مادة 48", "حرية الصحافة والطباعة والنشر وسائر وسائل الإعلام مكفولة. وتؤدى رسالتها بحرية واستقلال لخدمة المجتمع والتعبير عن اتجاهات الرأى العام والإسهام فى تكوينه وتوجيهه فى إطار المقومات الأساسية للدولة والمجتمع والحفاظ على الحقوق والحريات والواجبات العامة، واحترام حرمة الحياة الخاصة للمواطنين ومقتضيات الأمن القومى؛ ويحظر وقفها أو غلقها أو مصادرتها إلا بحكم قضائى. والرقابة على ما تنشره وسائل الإعلام محظورة، ويجوز استثناء أن تفرض عليها رقابة محددة فى زمن الحرب أو التعبئة العامة."));
        items.add(new Item("مادة 49", "حرية إصدار الصحف وتملكها، بجميع أنواعها، مكفولة بمجرد الإخطار لكل شخص مصرى طبيعى أو اعتبارى.\n" +
                "وينظم القانون إنشاء محطات البث الإذاعى والتليفزيونى ووسائط الإعلام الرقمى وغيرها."));
        items.add(new Item("مادة 50", "للمواطنين حق تنظيم الاجتماعات العامة والمواكب والتظاهرات السلمية، غير حاملين سلاحا، ويكون ذلك بناء على إخطار ينظمه القانون.\n" +
                "وحق الاجتماعات الخاصة مكفول دون إخطار، ولا يجوز لرجال الأمن حضورها أو التنصت عليها."));
        items.add(new Item("مادة 51", "للمواطنين حق تكوين الجمعيات والمؤسسات الأهلية والأحزاب بمجرد الإخطار، وتمارس نشاطها بحرية، وتكون لها الشخصية الاعتبارية.\n" +
                "ولا يجوز للسلطات حلها أو حل هيئاتها الإدارية إلا بحكم قضائى؛ وذلك على النحو المبين بالقانون."));
        items.add(new Item("مادة 52", "حرية إنشاء النقابات والاتحادات والتعاونيات مكفولة. وتكون لها الشخصية الاعتبارية، وتقوم على أساس ديمقراطى، وتمارس نشاطها بحرية، وتشارك فى خدمة المجتمع وفى رفع مستوى الكفاءة بين أعضائها والدفاع عن حقوقهم.\n" +
                "ولا يجوز للسلطات حلها أو حل مجالس إدارتها إلا بحكم قضائى."));
        items.add(new Item("مادة 53", "ينظم القانون النقابات المهنية، وإدارتها على أساس ديمقراطى، وتحديد مواردها، وطريقة مساءلة أعضائها عن سلوكهم فى ممارسة نشاطهم المهنى وفق مواثيق شرف أخلاقية. ولا تنشأ لتنظيم المهنة سوى نقابة مهنية واحدة.\n" +
                "ولا يجوز للسلطات حل مجلس إدارتها إلا بحكم قضائى، ولا تفرض عليها الحراسة."));
        items.add(new Item("مادة 54", "لكل شخص حق مخاطبة السلطات العامة كتابة وبتوقيعه. ولا تكون مخاطبتها باسم الجماعات إلا للأشخاص الاعتبارية."));
        items.add(new Item("مادة 55", "مشاركة المواطن فى الحياة العامة واجب وطنى؛ ولكل مواطن حق الانتخاب، والترشح، وإبداء الرأى فى الاستفتاء. وينظم القانون مباشرة هذه الحقوق.\n" +
                "وتلتزم الدولة بإدراج اسم كل مواطن بقاعدة بيانات الناخبين دون طلب، متى توافرت فيه شروط الناخب.\n" +
                "وتكفل الدولة سلامة الاستفتاءات والانتخابات وحيدتها ونزاهتها. وتدخل أجهزتها بالتأثير فى شىء من ذلك جريمة يعاقب عليها القانون."));
        items.add(new Item("مادة 56", "ترعى الدولة مصالح المصريين المقيمين بالخارج، وتحميهم، وتكفل حقوقهم وحرياتهم، وتعينهم على أداء واجباتهم العامة نحو الدولة والمجتمع المصرى، وتشجع إسهامهم فى تنمية الوطن.\n" +
                "وينظم القانون مشاركتهم فى الانتخابات والاستفتاءات."));
        items.add(new Item("مادة 57", "تمنح الدولة حق الالتجاء للأجانب المحرومين فى بلادهم من الحقوق والحريات العامة التى يكفلها الدستور.\n" +
                "ويحظر تسليم اللاجئين السياسيين. وكل ذلك وفقا لما ينظمه القانون."));
        items.add(new Item("مادة 58", "لكل مواطن الحق فى التعليم عالى الجودة، وهو مجانى بمراحله المختلفة فى كل مؤسسات الدولة التعليمية، وإلزامى فى مرحلة التعليم الأساسى، وتتخذ الدولة كافة التدابير لمد الإلزام إلى مراحل أخرى.\n" +
                "وتُعنى الدولة بالتعليم الفنى، وتشجعه، وتشرف على التعليم بكل أنواعه، وتخصص له نسبة كافية من الناتج القومى.\n" +
                "وتلتزم جميع المؤسسات التعليمية العامة والخاصة والأهلية وغيرها بخطة الدولة التعليمية وأهدافها؛ وذلك كله بما يحقق الربط بين التعليم وحاجات المجتمع والإنتاج."));
        items.add(new Item("مادة 59", "حرية البحث العلمى مكفولة. والجامعات والمجامع العلمية واللغوية ومراكز البحث العلمى مستقلة، وتخصص لها الدولة نسبة كافية من الناتج القومى."));
        items.add(new Item("مادة 60", "اللغة العربية مادة أساسية فى مراحل التعليم المختلفة بكل المؤسسات التعليمية.\n" +
                "والتربية الدينية والتاريخ الوطنى مادتان أساسيتان فى التعليم قبل الجامعى بكل أنواعه.\n" +
                "وتلتزم الجامعات بتدريس القيم والأخلاق اللازمة للتخصصات العلمية المختلفة."));
        items.add(new Item("مادة 61", "تلتزم الدولة بوضع خطة شاملة للقضاء على الأمية وتجفيف منابعها لكافة الأعمار، من الذكور والإناث. وتتولى تنفيذها بمشاركة المجتمع خلال عشر سنوات من تاريخ العمل بالدستور."));
        items.add(new Item("مادة 62", "الرعاية الصحية حق لكل مواطن، تخصص له الدولة نسبة كافية من الناتج القومى.\n" +
                "وتلتزم الدولة بتوفير خدمات الرعاية الصحية، والتأمين الصحى وفق نظام عادل عالى الجودة، ويكون ذلك بالمجان لغير القادرين.\n" +
                "وتلتزم جميع المنشآت الصحية بتقديم العلاج بأشكاله المختلفة لكل مواطن فى حالات الطوارئ أو الخطر على الحياة.\n" +
                "وتشرف الدولة على كافة المنشآت الصحية، وتتحقق من جودة خدماتها، وتراقب جميع المواد والمنتجات ووسائل الدعاية المتصلة بالصحة؛ وتصدر التشريعات وتتخذ كافة التدابير التى تحقق هذه الرقابة."));
        items.add(new Item("مادة 63", "لكل شخص الحق فى بيئة صحية سليمة. وتلتزم الدولة بصون البيئة وحمايتها من التلوث، واستخدام الموارد الطبيعية؛ بما يكفل عدم الإضرار بالبيئة، والحفاظ على حقوق الأجيال فيها."));
        items.add(new Item("مادة 64", "العمل حق وواجب وشرف لكل مواطن، تكفله الدولة على أساس مبادئ المساواة والعدالة وتكافؤ الفرص.\n" +
                "ولا يجوز فرض أى عمل جبرا إلا بمقتضى قانون.\n" +
                "ويعمل الموظف العام فى خدمة الشعب، وتتيح الدولة الوظائف العامة للمواطنين على أساس الجدارة، دون محاباة أو وساطة، ومخالفة ذلك جريمة يعاقب عليها القانون.\n" +
                "وتكفل الدولة حق كل عامل فى الأجر العادل والإجازات، والتقاعد والتأمين الاجتماعى، والرعاية الصحية، والحماية ضد مخاطر العمل، وتوافر شروط السلامة المهنية فى أماكن العمل؛ وفقا للقانون. ولا يجوز فصل العامل إلا فى الحالات المنصوص عليها فى القانون.\n" +
                "والإضراب السلمى حق، وينظمه القانون."));
        items.add(new Item("مادة 65", "تكرم الدولة شهداء ثورة الخامس والعشرين من يناير وغيرهم من شهداء الحرب والواجب الوطنى والمصابين فيها. وتكفل الرعاية اللازمة لأسرهم، وللمصابين، وللمحاربين القدامى، ولأسر المفقودين فى الحرب وما فى حكمها. ويكون لهم ولأبنائهم ولزوجاتهم الأولوية فى فرص العمل.\n" +
                "وكل ذلك وفقًا لما ينظمه القانون."));
        items.add(new Item("مادة 66", "تكفل الدولة خدمات التأمين الاجتماعى.\n" +
                "ولكل مواطن الحق فى الضمان الاجتماعى؛ إذا لم يكن قادرا على إعالة نفسه أو أسرته، فى حالات العجز عن العمل أو البطالة أو الشيخوخة، وبما يضمن لهم حد الكفاية."));
        items.add(new Item("مادة 67", "تعمل الدولة على توفير معاش مناسب لصغار الفلاحين والعمال الزراعيين والعمالة غير المنتظمة، ولكل من لا يتمتع بنظام التأمين الاجتماعى.\n" +
                "وينظم القانون ذلك."));
        items.add(new Item("مادة 68", "المسكن الملائم والماء النظيف والغذاء الصحى حقوق مكفولة.\n" +
                "وتتبنى الدولة خطة وطنية للإسكان؛ تقوم على العدالة الاجتماعية، وتشجيع المبادرات الذاتية والتعاونيات الإسكانية، وتنظيم استخدام أراضى الدولة لأغراض العمران؛ بما يحقق الصالح العام، ويحافظ على حقوق الأجيال."));
        items.add(new Item("مادة 69", "ممارسة الرياضة حق للجميع.\n" +
                "وعلى مؤسسات الدولة والمجتمع اكتشاف الموهوبين رياضيا ورعايتهم، واتخاذ ما يلزم من تدابير لتشجيع ممارسة الرياضة."));
        items.add(new Item("مادة 70", "لكل طفل، فور الولادة، الحق فى اسم مناسب، ورعاية أسرية، وتغذية أساسية، ومأوى، وخدمات صحية، وتنمية دينية ووجدانية ومعرفية.\n" +
                "وتلتزم الدولة برعايته وحمايته عند فقدانه أسرته، وتكفل حقوق الطفل المعاق وتأهيله واندماجه فى المجتمع.\n" +
                "ويحظر تشغيل الطفل، قبل تجاوزه سن الإلزام التعليمى، فى أعمال لا تناسب عمره، أو تمنع استمراره فى التعليم.\n" +
                "ولا يجوز احتجاز الطفل إلا لمدة محددة، وتوفر له المساعدة القانونية، ويكون احتجازه فى مكان مناسب؛ يراعى فيه الفصل بين الجنسين، والمراحل العمرية، ونوع الجريمة، والبعد عن أماكن احتجاز البالغين."));
        items.add(new Item("مادة 71", "تكفل الدولة رعاية النشء والشباب، وتأهيلهم وتنميتهم روحيا وخلقيا وثقافيا وعلميا وبدنيا ونفسيا واجتماعيا واقتصاديا، وتمكينهم من المشاركة السياسية الفاعلة."));
        items.add(new Item("مادة 72", "لتزم الدولة برعاية ذوى الإعاقة صحيًا وتعليميًا واقتصاديًا واجتماعيًا، وتوفر لهم فرص العمل، وترتقى بالثقافة الاجتماعية نحوهم، وتهيئ المرافق العامة بما يناسب احتياجاتهم."));
        items.add(new Item("مادة 73", "يُحظر كل صور القهر، والاستغلال القسرى للإنسان، وتجارة الجنس.\n" +
                "ويُجرم القانون كل ذلك.\n"));
        items.add(new Item("مادة 74", "سيادة القانون أساس الحكم فى الدولة.\n" +
                "واستقلال القضاء وحصانة القضاة ضمانتان أساسيتان لحماية الحقوق والحريات."));
        items.add(new Item("مادة 75", "التقاضى حق مصون ومكفول للناس كافة.\n" +
                "وتلتزم الدولة بتقريب جهات التقاضى وسرعة الفصل فى القضايا.\n" +
                "ويحظر تحصين أى عمل أو قرار إدارى من رقابة القضاء.\n" +
                "ولا يحاكم شخص إلا أمام قاضيه الطبيعى؛ والمحاكم الاستثنائية محظورة."));
        items.add(new Item("مادة 76", "العقوبة شخصية، ولا جريمة ولا عقوبة إلا بنص دستورى أو قانونى، ولا توقع عقوبة إلا بحكم قضائى، ولا عقاب إلا على الأفعال اللاحقة لتاريخ نفاذ القانون."));
        items.add(new Item("مادة 77", "فيما عدا الأحوال التى يحددها القانون، لا تقام الدعوى الجنائية إلا بأمر من جهة قضائية مختصة.\n" +
                "والمتهم برئ حتى تثبت إدانته فى محاكمة قانونية عادلة تكفل له فيها ضمانات الدفاع؛ وكل متهم فى جناية يجب أن يكون له محام يدافع عنه، ويحدد القانون الجنح التى يجب أن يكون للمتهم محام فيها.\n" +
                "وينظم القانون استئناف الأحكام الصادرة فى جنحة أو جناية.\n" +
                "وتوفر الدولة الحماية للمجنى عليهم والشهود والمتهمين والمبلغين عند الاقتضاء."));
        items.add(new Item("مادة 78", "حق الدفاع أصالة أو بالوكالة مكفول.\n" +
                "ويضمن القانون لغير القادرين ماليا وسائل الالتجاء إلى القضاء، والدفاع أمامه عن حقوقهم."));
        items.add(new Item("مادة 79", "تصدر الأحكام وتنفذ باسم الشعب. وامتناع الموظف العام المختص عن تنفيذها أو تعطيل تنفيذها جريمة يعاقب عليها القانون؛ وللمحكوم له فى هذه الحالة حق رفع الدعوى الجنائية مباشرة إلى المحكمة المختصة."));
        items.add(new Item("مادة 80", "كل اعتداء على أى من الحقوق والحريات المكفولة فى الدستور جريمة لا تسقط عنها الدعوى الجنائية ولا المدنية بالتقادم، وتكفل الدولة تعويضا عادلاً لمن وقع عليه الاعتداء.\n" +
                "وللمضرور إقامة الدعوى الجنائية عنها بالطريق المباشر.\n" +
                "وللمجلس القومى لحقوق الإنسان إبلاغ النيابة العامة عن أى انتهاك لهذه الحقوق، وله أن يتدخل فى الدعوى المدنية منضما إلى المضرور، وأن يطعن لمصلحته فى الأحكام."));
        items.add(new Item("مادة 81", "الحقوق والحريات اللصيقة بشخص المواطن لا تقبل تعطيلا ولا انتقاصا.\n" +
                "ولا يجوز لأى قانون ينظم ممارسة الحقوق والحريات أن يقيدها بما يمس أصلها وجوهرها.\n" +
                "وتُمارس الحقوق والحريات بما لا يتعارض مع المقومات الواردة فى باب الدولة والمجتمع بهذا الدستور.\n"));
        make_adapter();

    }

    private void section_3() {
        items = new ArrayList<>();
        String x = getResources().getString(R.string.section_3_2012);
        String mada = " مادة ";

        for(String word: x.split(mada))
        {
            items.add(new Item("مادة "+word.substring(0,3),word.substring(3,word.length())));
        }
        make_adapter();
    }

    private void section_4() {
        items = new ArrayList<>();
        String x = getResources().getString(R.string.section_4_2012);
        String mada = " مادة ";

        for(String word: x.split(mada))
        {
            items.add(new Item("مادة "+word.substring(0,3),word.substring(3,word.length())));
        }
        make_adapter();
    }
    private void section_5() {
        items = new ArrayList<>();
        String x = getResources().getString(R.string.section_5_2012);
        String mada = " مادة ";

        for(String word: x.split(mada))
        {
            items.add(new Item("مادة "+word.substring(0,3),word.substring(3,word.length())));
        }
        make_adapter();
    }
    private void make_adapter() {
        adapter2012 = new Adapter2012(items,mContext);
        RecyclerView.LayoutManager mLayoutManager = new LinearLayoutManager(getContext());
        recyclerView.setLayoutManager(mLayoutManager);
        recyclerView.setItemAnimator(new DefaultItemAnimator());
        recyclerView.setAdapter(adapter2012);
        adapter2012.notifyDataSetChanged();
    }

}